/* ifthenelseif.pli */
DCL x FIXED DECIMAL(5) INIT(5);

IF x = 5 THEN
    PUT LIST('x is 5');
ELSE IF x < 10 THEN
    PUT LIST('x is less than 10');
END IF;
